Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/legal_prerequisites_for_marriage.html.txt.tmx
Source language: en
Languages: ga

source: Getting married is a serious commitment
ga: Gealltanas tábhachtach atá sa phósadh

source: Marriage is a legally binding contract that will affect both parties (and, to a certain extent, their children) for all of their lives
ga: Conradh dleathúil atá ann a mbeidh tionchar aige ar an dá pháirtí (agus, go teoranta ar a gclann) ar feadh a saoil agus fiú i ndiaidh a mbáis

source: There are a number of strict rules and regulations governing marriage
ga: Tá roinnt rialacha daingne a bhaineann le pósadh

source: The first set of rules specifies who may and may not marry each other and in what circumstances
ga: Baineann an chéad chuid le cé hiad na daoine gur féidir agus nach féidir leo pósadh agus cé na cúinsí a bhaineann leis sin

source: Once you have fulfilled these conditions and are sure that you are entitled to marry, you should consider how you wish to marry
ga: Nuair atá na coinníollacha seo sásta agat ba cheart an cinneadh a dhéanamh cén chaoi gur mhaith leat pósadh

source: There are several different ways (religious, secular and civil) of solemnising a marriage so that it is legally binding
ga: Tá roinnt bealaí eagsúla ann le pósadh (searmanas cráifeach, saolta agus sibhialta) sa chaoi go mbeidh sé dleathúil

source: Please note that this section deals only with the legal requirements for the capacity to marry
ga: Baineann an píosa seo leis na rialacha dleathúla amháin a bhaineann le pósadh

source: If you are marrying through a religious or secular ceremony, you should discuss their requirements with the celebrant of your marriage
ga: Má tá tú le pósadh ag searmanas cráifeach nósaolta ba cheart a gcuid coinníollacha a phlé le céiliúraí an phósta

source: To contract a legally valid marriage in Ireland the parties to the marriage must:
ga: Le pósadh dleathúil a chur i gcrích in Éirinn ní mór do na páirtithe:

source: • Have the capacity to marry each other
ga: • a bheith in ann a chéile a phósadh

source: • Freely consent to the marriage
ga: • pósadh dhá ndeoin féin

source: Free consent may be absent if, at the time of the marriage, a person is suffering from intoxication, brain damage, mental disability, mental instability or insanity to the extent that he/she is not able to understand the implications of marriage
ga: D'fhéadfadh sé nach mbeadh an pósadh curtha i gcrích dá d(h)eoin féin má tá duine ar meisce, duine ag fulaingt damáiste intinne, míchumas intinne, neamhshéasmhacht intinne nó gealtachta agus nach dtuigeann sé/sí na himpleachtaí a bhaineann leis an bpósadh

source: Additionally, if someone agrees to marry because of threats or intimidation, his/her apparent consent may also be invalid and the marriage may be void
ga: Sa bhreis ar sin, má aontaíonn duine pósadh de bharr bagartha nó imeaglaithe, d'fhéadfadh sé go mbeadh a t(h)oil samhalta neamhbhailí agus mar sin nach mbeadh aon phósadh ann

source: • Observe the necessary formalities
ga: • cloí leis na rialacha cuí

source: To be legally entitled to marry, both of you must fulfil all of the following requirements at the time the marriage takes place
ga: Le bheith i dteideal chun pósadh go dlíthiúil, ní mór dá tú a chomhlíonadh gach ceann de na ceanglais seo a leanas ag an am a thógann an pósadh ar siúl

source: • Be over 18 years of age or have a Court Exemption Order if this is not the case
ga: • Bheith os cionn 18 mbliana d’aois nó Ordú Díolúine Chúirte a bheith agat murab amhlaidh an cás

source: • Have given the Registrar 3 months' notification of the marriage (or have a Court Exemption Order if this is not the case) and have been issued by the Registrar with a Marriage Registration Form
ga: • Fógra i leith an phósta trí mhí a bheith tugtha maidir leis an bpósadh (nó Ordú Díolúine Chúirte a bheith agat murab amhlaidh an cás) agus Foirm Chlárúcháin Phósta a bheith eisithe duit ag an gCláraitheoir

source: A couple whose civil partnership was registered in Ireland do not have to give the 3 months' notice
ga: Níl ar lánúin a raibh a bpáirtnéireacht shibhialta cláraithe in Éirinn an fógra 3 mhí a thabhairt

source: • Be either single, widowed, divorced, a former civil partner of a civil partnership that ended through death or dissolution, or have had a civil annulment of a marriage or civil partnership or a valid foreign divorce or dissolution
ga: • Bheith singil, ina mbaintreach/baintreach fir, colscartha, nó ina n-iar-pháirtnéirí sibhialta i bpáirtnéireacht shibhialta ar cuireadh deireadh léi trí bhás nó scaoileadh, nó neamhniú sibhialta a bheith déanta ar bhur bpósadh nó páirtnéireacht shibhialta nó colscaradh nó scaoileadh bailí iasachta a bheith faighte agaibh

source: (If you are marrying your civil partner you do not need to have your civil partnership dissolved before marrying
ga: (Má tá do pháirtnéir á phósadh agaibh, ní gá go ndéanfar bhur bpáirtéirneacht shibhialta á scaoileadh sula bpósfar sibh

source: It will be automatically dissolved when you marry.)
ga: Scaoilfear í go huathoibríoch nuair a phósfar sibh.)

source: • Have the mental capacity to understand the nature of marriage
ga: • An cumas meabhrach a bheith agaibh cineál an phósta a thuiscint

source: • Not be related by blood or marriage to a degree that prohibits you in law from marrying each other
ga: • Gan gaol fola nó pósta a bheith eadraibh a dhlúithe sin a chuireann toirmeasc oraibh sa dlí óna chéile a phósadh

source: If you are related to your proposed spouse by blood or by marriage, you should contact a solicitor to ensure that you do not fall within the prohibited degree of relationship
ga: Má tá tú gaol fola nó pósta agat le do chéile beartaithe, ba cheart duit teagmháil a dhéanamh le haturnae lena chinntiú nach dtagann tú faoi chuimsiú na teorann toirmiscthe caidrimh

source: (See "Further information" below on prohibited degrees
ga: (Féach “Breis faisnéise” thíos maidir le teorainneacha toirmiscthe

source: If either party doesn't fulfil even one of the above requirements, any subsequent marriage ceremony is legally void
ga: Mura gcomhlíonann ceachtar páirtí fiú ceann amháin de na ceanglais thuas, beidh aon searmanas pósta a dtabharfar faoi ina dhiaidh sin ar neamhní go dlíthiúil

source: Note: Since 16 November 2015 the requirement to be of opposite sex does not apply
ga: Nóta: Ón 16 Samhain 2015, ní bhaineann an ceanglas go mbeidh lánúineacha den ghnéas eile

source: If you are ordinarily resident in the State, the minimum age at which you may marry is 18 years (unless you have a Court Exemption Order)
ga: Má tá gnáthchónaí ort i Stát na hÉireann, is í an aois íosta ag ar féidir leat pósadh 18 mbliana d’aois (mura bhfuil Ordú Díolúine Chúirte agat)

source: This is the case even if you marry outside of Ireland
ga: Is ionann an cás fiú má phósann tú lasmuigh d’Éirinn

source: Even if you are not ordinarily resident in the State, you must be over 18 years of age if you wish to marry someone in Ireland
ga: Fiú mura bhfuil gnáthchónaí ort i Stát na hÉireann, ní mór duit bheith os cionn 18 mbliana d’aois más mian leat duine a phósadh in Éirinn

source: There is no requirement for parental consent to a marriage, irrespective of the ages of the parties concerned
ga: Níl aon riachtanas ann chun toiliú tuismitheora a fháil i leith pósta, is cuma cén aois iad na páirtithe lena mbaineann

source: Exemption from age requirement
ga: Díolúine ón riachtanas aoise

source: In certain special circumstances, you may be able to get a Court Exemption Order allowing the marriage to proceed even if one or both parties are under 18
ga: Faoi chúinsí speisialta áirithe, d’fhéadfá bheith in ann Ordú Díolúine Chúirte a fháil a ligfidh don phósadh leanúint ar aghaidh fiú má tá páirtí amháin nó an bheirt pháirtithe faoi bhun 18

source: The court will require you to show:
ga: Iarrfaidh an chúirt ort an méid a leanas a léiriú:

source: • That there are good reasons for your application
ga: • Gurb ann do thréanchúiseanna le d’iarratas

source: • That the granting of such an Exemption Order is in the best interests of the parties to the intended marriage
ga: • Go bhfuil deonú an Ordaithe Díolúine sin chun leasa is fearr na bpáirtithe don phósadh a bheartaítear

source: You should contact either the Circuit Family Court or the High Court for details on how to proceed
ga: Ba cheart duit teagmháil a dhéanamh leis an gCúirt Teaghlaigh Chuarda nó an Ard-Chúirt chun teacht ar shonraí faoi conas leanúint ar aghaidh

source: This is an informal procedure
ga: Nós imeachta neamhfhoirmiúil atá i gceist leis seo

source: You may apply in person (without hiring a solicitor)
ga: Féadfaidh tú iarratas a dhéanamh tú féin (gan aturnae a fhruiliú)

source: There is no court charge for an application for a Court Exemption Order
ga: Ní bheidh aon táille chúirte ann le haghaidh iarratais ar Ordú Díolúine Chúirte

source: However, if you hire a solicitor to represent you, you will have to pay him/her
ga: Má dhéanann tú aturnae a fhruiliú le hionadaíocht a dhéanamh duit, beidh ort íoc as/aisti, áfach

source: Not all foreign divorces are recognised under Irish law
ga: Ní aithnítear gach colscaradh iasachta faoi dhlí na hÉireann

source: Under the Domicile and Recognition of Foreign Divorces Act 1986, a foreign divorce will only be recognised in Ireland if at least one spouse was domiciled in the state that granted the divorce when the proceedings started
ga: Faoin Shainchónaí agus Aithint Colscarthaí Coigríche 1986, ní aithneofar colscaradh iasachta in Éirinn ach amháin má bhí sainchónaí ar a laghad céile amháin sa stat a dheonaigh an colscaradh nuair a cuireadh tús leis na himeachtaí

source: You may have to provide good evidence that this was the case and, therefore, that the divorce is valid under Irish law
ga: B'fhéidir go mbeidh ort fianaise a chur ar fáil lena chruthú gurb amhlaidh a bhí an cás agus, ar an ábhar sin, go bhfuil an colscaradh bailí faoi dhlí na hÉireann

source: Under EU Regulation 2201/2003 (“the Brussels II bis”) it is the spouse’s habitual residence that determines a court’s right to grant a divorce
ga: Faoi Rialachán AE 2201/2003 ("na bis na Bruiséile II"), tá sé gnáthchónaí an chéile go gcinnfidh an ceart cúirte colscaradh a dheonú

source: Where the divorce comes within EU regulations, it is sufficient to confirm that both parties to the divorce were notified of the proceedings and had an opportunity to give evidence to the court which granted the divorce
ga: Nuair a thagann colscaradh faoi chuimsiú rialacháin an AE, is leor a dheimhniú gur cuireadh an bheirt pháirtithe don cholscaradh ar an eolas faoi na himeachtaí agus go raibh deis acu chun fianaise a thabhairt don chúirt a dheonaigh an colscaradh

source: Where EU regulations do not apply, certain information as to place of birth, countries of residence and other relevant facts must be supplied on a questionnaire provided by the Registrar
ga: Sa chás nár bhain rialacháin AE, ní mór faisnéis áirithe faoi áit bhreithe, tíortha cónaithe agus fíricí ábhartha eile a chur ar fáil ar cheistneoir a chuireann an Cláraitheoir ar fáil

source: The information is then forwarded to the General Register Office, whose consent is required before the marriage ceremony can take place
ga: Cuirtear an fhaisnéis ar aghaidh ansin chuig an bPríomh-Oifig Chárúcháin, nach mór a dtoiliú a fháil sular féidir le searmanas an phósta leanúint ar aghaidh

source: If the General Registrar is of the opinion that the foreign divorce is valid, then the new marriage can go ahead
ga: Má bhíonn an Cláraitheoir Ginearálta faoin tuairim gur bailí don cholscaradh iasachta, féadfaidh an pósadh nua leanúint ar aghaidh

source: If not, you can provide additional information to prove validity or else you can apply for a hearing before the Circuit Court
ga: Murab amhlaidh tuairim an Chláraitheora Ghinearálta, féadfaidh tú tuilleadh faisnéise a chur ar fáil chun bailíocht a chruthú nó féadfaidh tú iarratas a dhéanamh ar éisteacht os comhair na Cúirte Cuarda

source: The Court's decision on the validity of a foreign divorce in Irish law is final and binding, although you may, of course, appeal to a higher court
ga: Cinneadh deiridh atá ina cheangal atá i gcinneadh na Cúirte maidir le bailíocht cholscaradh iasachta i ndlí na hÉireann, ach féadfaidh tú, dar ndóigh, achomharc a dhéanamh do chúirt níos airde

source: If the Court decides that your foreign divorce is not binding, your only option if you wish to remarry in Ireland may be to get a divorce under Irish law
ga: Má dhéanann an Chúirt an cinneadh nach bhfuil do cholscaradh iasachta ina cheangal, is é an t-aon rogha atá agat, más mian leat pósadh arís in Éirinn, colscaradh a fháil faoi dlí na hÉireann

source: If a legal dissolution of a civil partnership is granted outside Ireland, it will be recognised under Irish law if the Minister of Justice and Equality has made an order recognising the appropriate class of legal relationship in the country in which the dissolution was granted
ga: Má cheadaítear scaoileadh dlíthiúil páirtnéireachta sibhialta lasmuigh d’Éirinn, aithneofar é faoi dhlí na hÉireann, má rinne an tAire Dlí agus Cirt ordú a aithníonn an aicme chuí den chaidreamh dlíthiúil sa tír inar ceadaíodh an scaoileadh

source: Prohibitions apply to marriage between certain people related by blood or marriage
ga: Baineann toirmisc le pósadh idir daoine áirithe a bhfuil gaol fola nó pósta eatarthu

source: A couple who fall within the prohibited degrees of relationship cannot marry
ga: Ní féidir le lánúin a thagann faoi chuimsiú na dteorainneacha toirmiscthe caidrimh pósadh

source: These prohibitions are based on:
ga: Tá na toirmisc seo bunaithe ar an méid a leanas:

source: • Consanguinity – blood relationship including half blood (half blood means having one parent in common, for example a half-brother)
ga: • Gaol fola – caidreamh fola, caidreamh leathghaol fola (ciallaíonn ‘leathghaol fola’ go mbíonn tuismitheoir amháin i gcoiteann, mar shampla, leathdheartháir)

source: • Affinity – relationship by marriage
ga: • Gaol cleamhnais – caidreamh trí phósadh

source: The prohibited degrees apply to a wide range of family relationships and include marital and non-marital offspring
ga: Baineann an teorainn thoirmiscthe le réimse fairsing de chaidreamh teaghlaigh agus áirítear léi sliocht pósta agus neamhphósta araon

source: An adopted child is within the prohibited degrees in relation to its natural family and adoptive parents
ga: Tá leanbh uchtaithe laistigh de na teorainneacha toirmiscthe maidir lena dteaghlach nádúrtha agus a dtuismitheoirí uchtaíocha

source: However, it would appear an adopted child can marry the child of their adoptive parents
ga: Ba dhealraitheach, áfach, gur féidir le leanbh uchtaithe leanbh a dtuismitheoirí uchtaíocha a phósadh

source: You can marry your deceased spouse's sister or brother
ga: Féadfaidh tú deirfiúr nó deartháir do chéile éagtha a phósadh

source: This also applies if your marriage ends due to a divorce rather than a death
ga: Is amhlaidh a bhíonn i gceist, chomh maith, má chuireann colscaradh, seachas bás, deireadh le do phósadh

source: There is no legal restriction on the marriage of first cousins
ga: Níl aon chosc dlíthiúil ann ar phósadh col ceathracha
